constant/flowrate
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      flowrate;
}

// Set to "yes" to repeat the table periodically after it reaches the end.
// If omitted or set to "no", the last value will be held constant.
repeat  yes;

values
(
(0.00000000	0.00005258)
(0.00100000	0.00005511)
(0.00200000	0.00005765)
(0.00300000	0.00006018)
(0.00400000	0.00006271)
(0.00500000	0.00006525)
(0.00600000	0.00006778)
(0.00700000	0.00007032)
(0.00800000	0.00007285)
(0.00900000	0.00007538)
(0.01000000	0.00007792)
(0.01100000	0.00008045)
(0.01200000	0.00008298)
(0.01300000	0.00008552)
(0.01400000	0.00008805)
(0.01500000	0.00009059)
(0.01600000	0.00009312)
(0.01700000	0.00009565)
(0.01800000	0.00009819)
(0.01900000	0.00010072)
(0.02000000	0.00010326)
(0.02100000	0.00010579)
(0.02200000	0.00010832)
(0.02300000	0.00011086)
(0.02400000	0.00011339)
(0.02500000	0.00011592)
(0.02600000	0.00011846)
(0.02700000	0.00012099)
(0.02800000	0.00012353)
(0.02900000	0.00012606)
(0.03000000	0.00012859)
(0.03100000	0.00013113)
(0.03200000	0.00013366)
(0.03300000	0.00013619)
(0.03400000	0.00013873)
(0.03500000	0.00014126)
(0.03600000	0.00014380)
(0.03700000	0.00014633)
(0.03800000	0.00014886)
(0.03900000	0.00015140)
(0.04000000	0.00015393)
(0.04100000	0.00015653)
(0.04200000	0.00015913)
(0.04300000	0.00016172)
(0.04400000	0.00016432)
(0.04500000	0.00016692)
(0.04600000	0.00016952)
(0.04700000	0.00017211)
(0.04800000	0.00017471)
(0.04900000	0.00017731)
(0.05000000	0.00017991)
(0.05100000	0.00018250)
(0.05200000	0.00018510)
(0.05300000	0.00018770)
(0.05400000	0.00019030)
(0.05500000	0.00019289)
(0.05600000	0.00019549)
(0.05700000	0.00019809)
(0.05800000	0.00020069)
(0.05900000	0.00020328)
(0.06000000	0.00020588)
(0.06100000	0.00020848)
(0.06200000	0.00021108)
(0.06300000	0.00021368)
(0.06400000	0.00021627)
(0.06500000	0.00021887)
(0.06600000	0.00022147)
(0.06700000	0.00022407)
(0.06800000	0.00022666)
(0.06900000	0.00022926)
(0.07000000	0.00023186)
(0.07100000	0.00023446)
(0.07200000	0.00023705)
(0.07300000	0.00023965)
(0.07400000	0.00024225)
(0.07500000	0.00024485)
(0.07600000	0.00024744)
(0.07700000	0.00025004)
(0.07800000	0.00025264)
(0.07900000	0.00025524)
(0.08000000	0.00025783)
(0.08100000	0.00025924)
(0.08200000	0.00026064)
(0.08300000	0.00026204)
(0.08400000	0.00026344)
(0.08500000	0.00026485)
(0.08600000	0.00026625)
(0.08700000	0.00026765)
(0.08800000	0.00026905)
(0.08900000	0.00027046)
(0.09000000	0.00027186)
(0.09100000	0.00027326)
(0.09200000	0.00027466)
(0.09300000	0.00027606)
(0.09400000	0.00027747)
(0.09500000	0.00027887)
(0.09600000	0.00028027)
(0.09700000	0.00028167)
(0.09800000	0.00028308)
...
);
