system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs
(
    "liblumpedParameterNetworkBC.so"
    "libfieldFunctionObjects.so"     // <-- needed for surfaceFieldValue, etc.

);
application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;//endTime;//switch this entry to 'writeNow' to complete the solution and write the data at the end of the current simulation
//noWriteNow: Stops simulation on completion of current time step and does not write out data.

endTime         10;

deltaT          0.00005;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      110;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.95;

maxDeltaT       1e-3;

functions
{
  // Aortic outlet
  Qaorta
  {
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");
    writeControl    timeStep;
    writeInterval   1;
    regionType      patch;
    name            outlet;
    operation       sum;
    fields          (phi);
    writeFields     false;
  }

  // Each coronary patch individually
  Q_Lc1
  {
    type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
    writeControl timeStep; writeInterval 1;
    regionType patch; name Lc1;
    operation sum; fields (phi); writeFields false;
  }

  Q_Lc1_sub1
  {
    type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
    writeControl timeStep; writeInterval 1;
    regionType patch; name Lc1_sub1;
    operation sum; fields (phi); writeFields false;
  }

  Q_Lc1_sub2
  {
    type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
    writeControl timeStep; writeInterval 1;
    regionType patch; name Lc1_sub2;
    operation sum; fields (phi); writeFields false;
  }

  Q_Lc1_sub3
  {
    type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
    writeControl timeStep; writeInterval 1;
    regionType patch; name Lc1_sub3;
    operation sum; fields (phi); writeFields false;
  }

  Q_Lc2
  {
    type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
    writeControl timeStep; writeInterval 1;
    regionType patch; name Lc2;
    operation sum; fields (phi); writeFields false;
  }

  Q_Lc2_sub1
  {
    type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
    writeControl timeStep; writeInterval 1;
    regionType patch; name Lc2_sub1;
    operation sum; fields (phi); writeFields false;
  }

  Q_Rc1
  {
    type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
    writeControl timeStep; writeInterval 1;
    regionType patch; name Rc1;
    operation sum; fields (phi); writeFields false;
  }

  Q_Rc1_sub1
  {
    type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
    writeControl timeStep; writeInterval 1;
    regionType patch; name Rc1_sub1;
    operation sum; fields (phi); writeFields false;
  }

  Q_Rc1_sub2
  {
    type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
    writeControl timeStep; writeInterval 1;
    regionType patch; name Rc1_sub2;
    operation sum; fields (phi); writeFields false;
  }

  // Mean pressure at aortic outlet (optional but handy)
  Pout_bar
  {
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");
    writeControl    timeStep;
    writeInterval   1;

    regionType      patch;
    name            outlet;
    operation       areaAverage;
    fields          (p);
    writeFields     false;
  }
Qinlet
{
  type            surfaceFieldValue;
  libs            ("libfieldFunctionObjects.so");
  writeControl    timeStep; writeInterval 1;
  regionType      patch; name inlet;
  operation       sum; fields (phi);
  writeFields     false;
}

}

// ************************************************************************* //
