system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{

        artery.stl {type triSurfaceMesh; name artery;}
        inlet.stl {type triSurfaceMesh; name inlet;}
        outlet.stl {type triSurfaceMesh; name outlet;}
	Lc1.stl       { type triSurfaceMesh; name Lc1; }
	Lc1_sub1.stl  { type triSurfaceMesh; name Lc1_sub1; }
	Lc1_sub2.stl  { type triSurfaceMesh; name Lc1_sub2; }
	Lc1_sub3.stl  { type triSurfaceMesh; name Lc1_sub3; }
	Lc2.stl       { type triSurfaceMesh; name Lc2; }
	Lc2_sub1.stl  { type triSurfaceMesh; name Lc2_sub1; }
	Rc1.stl       { type triSurfaceMesh; name Rc1; }
	Rc1_sub1.stl  { type triSurfaceMesh; name Rc1_sub1; }
	Rc1_sub2.stl  { type triSurfaceMesh; name Rc1_sub2; }
        combined.stl {type triSurfaceMesh; name combined;}

/*
    refinement1
    {
        type searchableSphere;
        centre (0 0 0.0025);
        radius 0.0075;
    }

    refinement2
    {
        type searchableCylinder;
        point1 (0 0 0);
        point2 (0 0 0.03);
        radius 0.0075;
    }

    refinement3
    {
        type searchableBox;
        min (-0.0294 -0.22 1.715);
        max (0.028 -0.18 1.775);
    }

    refinement4
    {
        type searchableBox;
        min (0.02597 -0.18512 1.68);
        max (0.071 -0.168 1.76);
    }    
    refinement5
    {
        type searchableBox;
        min (0.031 -0.26 1.65);
        max (0.087 -0.223 1.76);
    }    
    refinement6
    {
        type searchableBox;
        min (-0.0336 -0.251 1.658);
        max (0.0082 -0.219 1.744);
    }    
 */
    refinement1
{
    type searchableBox;
    min (-0.102252 0.0619086 -0.0603161);
    max (-0.0349279 0.130628 0.00338595);
}

refinement2
{
    type searchableBox;
    min (-0.079449 0.105602 -0.123148);
    max (-0.0410399 0.13692 -0.0592629);
}

refinement3
{
    type searchableBox;
    min (-0.0900233 0.0470735 -0.122271);
    max (-0.0274907 0.119521 -0.0698019);
}

refinement4
{
    type searchableBox;
    min (-0.158277 0.0589458 -0.0815988);
    max (-0.0883447 0.110277 -0.025557);
}

refinement5
{
    type searchableBox;
    min (-0.147408 0.0926705 -0.134852);
    max (-0.0946514 0.147006 -0.040674);
}

refinement6
{
    type searchableBox;
    min (-0.157583 0.0325513 -0.119144);
    max (-0.0864896 0.0863999 -0.0415538);
}

};



// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 1000000;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 50000000;	//byAP

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 10;

    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 1;



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        {file "inlet.eMesh"; level 3;}
        {file "outlet.eMesh"; level 3;}
        {file "artery.eMesh"; level 3;}
{ file "Lc1.eMesh";      level 3; }
{ file "Lc1_sub1.eMesh"; level 3; }
{ file "Lc1_sub2.eMesh"; level 3; }
{ file "Lc1_sub3.eMesh"; level 3; }
{ file "Lc2.eMesh";      level 3; }
{ file "Lc2_sub1.eMesh"; level 3; }
{ file "Rc1.eMesh";      level 3; }
{ file "Rc1_sub1.eMesh"; level 3; }
{ file "Rc1_sub2.eMesh"; level 3; }
    
    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        inlet {level (3 3);}
        outlet {level (3 3);}
        artery {level (3 3); patchInfo { type wall; }}
    Lc1       {level (3 3);}
Lc1_sub1  {level (3 3);}
Lc1_sub2  {level (3 3);}
Lc1_sub3  {level (3 3);}
Lc2       {level (3 3);}
Lc2_sub1  {level (3 3);}
Rc1       {level (3 3);}
Rc1_sub1  {level (3 3);}
Rc1_sub2  {level (3 3);}

    }

    // Resolve sharp angles
    resolveFeatureAngle 30;	//byAP


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
/*
        refinement1
        {
            mode inside;
            levels ((0.0 3));
        }

        refinement2
        {
            mode inside;
            levels ((0.0 2));
        }

        refinement3
        {
            mode inside;
            levels ((0.0 2));
        }
        refinement4
        {
            mode inside;
            levels ((0.0 2));
        }
        refinement5
        {
            mode inside;
            levels ((0.0 2));
        }
        refinement6
        {
            mode inside;
            levels ((0.0 2));
        }
	*/
refinement1
{
    mode inside;
    levels ((0.0 1));
}

refinement2
{
    mode inside;
    levels ((0.0 1));
}

refinement3
{
    mode inside;
    levels ((0.0 1));
}

refinement4
{
    mode inside;
    levels ((0.0 1));
}

refinement5
{
    mode inside;
    levels ((0.0 1));
}

refinement6
{
    mode inside;
    levels ((0.0 1));
}

    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    //locationInMesh (0 0 -10e-3);
    locationInMesh (-0.0664 0.0833 -0.022);	//byAP

    allowFreeStandingZoneFaces false;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 5;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 4.0;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 100;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;
    nFeatureSnapIter 10;

    implicitFeatureSnap true;

    explicitFeatureSnap true;

    multiRegionFeatureSnap true;
    
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Per final patch (so not geometry!) the layer information
    layers
    {
	valve {nSurfaceLayers 3;}
	aorta {nSurfaceLayers 2;}    
    }

    // Expansion factor for layer mesh
    expansionRatio 1.3;		//byAP

    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness 0.75;		//byAP

    //firstLayerThickness 0.5;		//byAP

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // Relative to undistorted size of cell outside layer.
    minThickness 0.1;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)
    nGrow 0;


    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 30;		//byAP

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 3;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 17x! 90 degrees corresponds to 130 in 17x.
    minMedianAxisAngle 90;

    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;

    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 100;	//byAP

    // Max number of iterations after which relaxed meshQuality controls
    // get used. Up to nRelaxIter it uses the settings in meshQualityControls,
    // after nRelaxIter it uses the values in meshQualityControls::relaxed.
    nRelaxedIter 50;		//byAP
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    //- Maximum non-orthogonality allowed. Set to 180 to disable.
    maxNonOrtho 65;		//byAP

    //- Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness 18;	//byAP
    maxInternalSkewness 4;	//byAP

    //- Max concaveness allowed. Is angle (in degrees) below which concavity
    //  is allowed. 0 is straight face, <0 would be convex face.
    //  Set to 180 to disable.
    maxConcave 80;

    //- Minimum pyramid volume. Is absolute volume of cell pyramid.
    //  Set to very negative number (e.g. -1E30) to disable.
    minVol 1e-20;

    //- Minimum quality of the tet formed by the face-centre
    //  and variable base point minimum decomposition triangles and
    //  the cell centre.  Set to very negative number (e.g. -1E30) to
    //  disable.
    //     <0 = inside out tet,
    //      0 = flat tet
    //      1 = regular tet
    minTetQuality 1e-30;

    //- Minimum face area. Set to <0 to disable.
    minArea -1;

    //- Minimum face twist. Set to <-1 to disable. dot product of face normal
    //  and face centre triangles normal
    minTwist 0.02;

    //- Minimum normalised cell determinant
    //  1 = hex, <= 0 = folded or flattened illegal cell
    minDeterminant 0.001;

    //- minFaceWeight (0 -> 0.5)
    minFaceWeight 0.02;

    //- minVolRatio (0 -> 1)
    minVolRatio 0.01;

    //must be >0 for Fluent compatibility
    minTriangleTwist -1;


    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- Amount to scale back displacement at error points
    errorReduction 0.75;
}


// Advanced

// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-7;


// ************************************************************************* //
